In [1]:
import numpy as np
import pandas as pd

In [8]:
dict1={"name":['Ayush','Raj','abc','def','ghi'], "marks":[70,80,55,44,66], "city":['Kota','Bangalore','pune','mumbai','delhi']}

In [155]:
dict1

{'name': ['Ayush', 'Raj', 'abc', 'def', 'ghi'],
 'marks': [70, 80, 55, 44, 66],
 'city': ['Kota', 'Bangalore', 'pune', 'mumbai', 'delhi']}

In [156]:
df = pd.DataFrame(dict1)

In [157]:
df

    name  marks       city
0  Ayush     70       Kota
1    Raj     80  Bangalore
2    abc     55       pune
3    def     44     mumbai
4    ghi     66      delhi

In [158]:
newdf=df.copy()

In [159]:
newdf

    name  marks       city
0  Ayush     70       Kota
1    Raj     80  Bangalore
2    abc     55       pune
3    def     44     mumbai
4    ghi     66      delhi

In [163]:
newdf.loc[0,'name']="Test"

In [166]:
newdf.loc[:,['name','marks']]

   name  marks
0  Test     70
1   Raj     80
2   abc     55
3   def     44
4   ghi     66